generate-bash-script-with-orgmode.org
#+AUTHOR: John Herrlin
#+EMAIL: jherrlin@gmail.com
#+TITLE: How I use Emacs org-mode to generate bash scripts
#+DATE: <2019-05-05 Sun>


* Abstract

  Example of how to use Emacs, Org mode and Clojure to generate a bash script.

* Main
** The setup

   Our environment is primary based on Heroku and AWS. Heroku is hosting our Clojure /
   ClojureScript apps and AWS EC2 instances hosts our MongoDBs. We have 2 DB servers, one
   for production and one for staging. The database name is the same as the Heroku app
   name. So the Heroku app =customer1-prod= have a database with the name
   =customer1-prod=. Each customer have 2 Heroku apps, one for staging and one for
   production. The stage app is used for our manual testing with the customers data before
   we depoy to production. The production app is the app the customer is using.


** The problem

   We are a small company with just 3 customer at the moment, but we are growing and more
   customers will join soon. I wanna have a simple way of copying the production database
   to the staging database. This way we can test changes on the state app before we put
   new code to production.

** The solution
*** Org mode tables

    First of I am using GNU/Linux. I dont wanna install much extra fluff to be able to
    handle this. I think a bash script could be nice! But I dont want to manually write
    and later maintain it. The risk of typos, mixing up stuff or forgetting things is to
    big (I am too much of a dumbass and needs a [[https://medium.com/@tasshin/implementing-a-second-brain-in-emacs-and-org-mode-ef0e44fb7ca5][second brain]]).

    I am using Emacs and Org mode for my day to day tasks and I wanted to solve this
    problem with this tools. At work we use Clojure and I am pretty familiar with it. By
    combining features of Org mode and Clojure I could maybe figure something out.

    Below is a [[https://orgmode.org/manual/Tables.html][Org mode table]] with the customers and the address to the respective
    database.

    Make a note about the =#+NAME: heroku-apps= in top of the table, this is important and
    I will explain later.

    #+BEGIN_SRC org
      ,#+NAME: heroku-apps
      | Heroku app name | AWS MongoDB host                                     |
      |-----------------+------------------------------------------------------|
      | customer1-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
      | customer1-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
      | customer2-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
      | customer2-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
      | customer3-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
      | customer3-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
    #+END_SRC

    First of all I want to structure the table into something more easy to use in
    Clojureland.

