generate-bash-script-with-orgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-05-05 Sun 14:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I use Emacs org-mode to generate bash scripts</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Herrlin" />
</head>
<body>
<div id="content">
<h1 class="title">How I use Emacs org-mode to generate bash scripts</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6b8cd27">1. Abstract</a></li>
<li><a href="#org85596ad">2. The stuff</a>
<ul>
<li><a href="#orgb99af3d">2.1. The setup</a></li>
<li><a href="#org187b1ef">2.2. The problem</a></li>
<li><a href="#orgaaa14cf">2.3. The solution</a>
<ul>
<li><a href="#org509e112">2.3.1. Org mode tables</a></li>
<li><a href="#org20690a4">2.3.2. Org mode source code blocks and babel</a></li>
<li><a href="#orgd19fee4">2.3.3. Generate a bash script</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbcc007d">3. Discussion</a></li>
</ul>
</div>
</div>


<div id="outline-container-org6b8cd27" class="outline-2">
<h2 id="org6b8cd27"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Example of how to use Emacs, Org mode and Clojure to generate a bash script.
</p>
</div>
</div>

<div id="outline-container-org85596ad" class="outline-2">
<h2 id="org85596ad"><span class="section-number-2">2</span> The stuff</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb99af3d" class="outline-3">
<h3 id="orgb99af3d"><span class="section-number-3">2.1</span> The setup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Our environment is primary based on Heroku and AWS. Heroku is hosting our Clojure /
ClojureScript apps and AWS EC2 instances hosts our MongoDBs. We have 2 DB servers, one
for production and one for staging. The database name is the same as the Heroku app
name. So the Heroku app <code>customer1-prod</code> have a database with the name
<code>customer1-prod</code>. Each customer have 2 Heroku apps, one for staging and one for
production. The stage app is used for our manual testing with the customers data before
we depoy to production. The production app is the app the customer is using.
</p>
</div>
</div>


<div id="outline-container-org187b1ef" class="outline-3">
<h3 id="org187b1ef"><span class="section-number-3">2.2</span> The problem</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We are a small company with just 3 customer at the moment, but we are growing and
more customers are joining in a rapid speed. I wanna have a simple way of copying the
production database to the staging database. This way we can test changes on the
state app before we put new code to production.
</p>
</div>
</div>

<div id="outline-container-orgaaa14cf" class="outline-3">
<h3 id="orgaaa14cf"><span class="section-number-3">2.3</span> The solution</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org509e112" class="outline-4">
<h4 id="org509e112"><span class="section-number-4">2.3.1</span> Org mode tables</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
First of I am using GNU/Linux. I dont wanna install much extra fluff to be able to
handle this. I think a bash script could be nice! But I dont want to manually write
and later maintain it. The risk of typos, mixing up stuff or forgetting things is to
big (I am too much of a dumbass and needs a <a href="https://medium.com/@tasshin/implementing-a-second-brain-in-emacs-and-org-mode-ef0e44fb7ca5">second brain</a>).
</p>

<p>
I am using Emacs and Org mode for my day to day tasks and I wanted to solve this
problem with this tools. At work we use Clojure and I am pretty familiar with it. By
combining features of Org mode and Clojure I could maybe figure something out.
</p>

<p>
Below is a <a href="https://orgmode.org/manual/Tables.html">Org mode table</a> with the customers and the address to the respective
database.
</p>

<p>
Make a note about the <code>#+NAME: heroku-apps</code> in top of the table, this is important and
I will explain later.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+NAME: heroku-apps</span>
<span style="color: #9FC59F;">| Heroku app name | AWS MongoDB host                                     |</span>
<span style="color: #9FC59F;">|-----------------+------------------------------------------------------|</span>
<span style="color: #9FC59F;">| customer1-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |</span>
<span style="color: #9FC59F;">| customer1-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |</span>
<span style="color: #9FC59F;">| customer2-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |</span>
<span style="color: #9FC59F;">| customer2-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |</span>
<span style="color: #9FC59F;">| customer3-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |</span>
<span style="color: #9FC59F;">| customer3-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |</span>
</pre>
</div>

<p>
First of all I want to structure the table into something more easy to use in
Clojureland.
</p>
</div>
</div>
