generate-bash-script-with-orgmode.org
*** Org mode source code blocks and babel

    Org mode have a feature called [[https://orgmode.org/worg/org-contrib/babel/][babel]]. It allows you to write code within =#+begin_src=
    blocks and execute them. By combinging Org mode tables and babel you can have the
    table as an input variable to the babel code. In the table we named it =heroku-apps=
    and in the code block below we have a heading with =:var ORGTABLE=heroku-apps=. This
    makes the table available in the snippet as the variable =ORGTABLE=.

    This is how clojure will represent the Org mode table. The =#+RESULTS:= part is the
    output after execution of the snippet.

    #+BEGIN_SRC org
      ,#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code
            (clojure.pprint/pprint ORGTABLE)
      ,#+END_SRC

      ,#+RESULTS:
      ,#+begin_src clojure
          (("customer1-stage"
            "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com")
           ("customer1-prod"
            "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com")
           ("customer2-stage"
            "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com")
           ("customer2-prod"
            "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com")
           ("customer3-stage"
            "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com")
           ("customer3-prod"
            "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"))
      ,#+end_src
    #+END_SRC


    The datastructure is a list with lists inside. I want to have it a little more
    structured to be able to work with it. The snippet bellow makes it easier for me to
    reason about it. The datastructure is a [[https://clojuredocs.org/clojure.core/hash-map][hash-map]] with hash-maps for each customer. In
    Clojure this will be very easy to work with.

    #+BEGIN_SRC org
      ,#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code
            (clojure.pprint/pprint
             (->> ORGTABLE
                  (reduce (fn [new-hashmap [app-name db-host]]
                            (let [[_ customer env] (re-matches #"^(.+)-(.+)$" app-name)]
                              (update new-hashmap customer merge {(keyword (str "app-name-" env)) app-name
                                                                  (keyword (str "db-host-" env)) db-host})))
                          {})))
      ,#+END_SRC

      ,#+RESULTS:
      ,#+begin_src clojure
        {"customer1"
         {:app-name-stage "customer1-stage",
          :db-host-stage  "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com",
          :app-name-prod  "customer1-prod",
          :db-host-prod   "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"},
         "customer2"
         {:app-name-stage "customer2-stage",
          :db-host-stage  "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com",
          :app-name-prod  "customer2-prod",
          :db-host-prod   "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"},
         "customer3"
         {:app-name-stage "customer3-stage",
          :db-host-stage  "lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com",
          :app-name-prod  "customer3-prod",
          :db-host-prod   "jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"}}
      ,#+end_src
    #+END_SRC


