generate-bash-script-with-orgmode.html

<div id="outline-container-org20690a4" class="outline-4">
<h4 id="org20690a4"><span class="section-number-4">2.3.2</span> Org mode source code blocks and babel</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Org mode have a feature called <a href="https://orgmode.org/worg/org-contrib/babel/">babel</a>. It allows you to write code within <code>#+begin_src</code>
blocks and execute them. By combinging Org mode tables and babel you can have the
table as an input variable to the babel code. In the table we named it <code>heroku-apps</code>
and in the code block below we have a heading with <code>:var ORGTABLE=heroku-apps</code>. This
makes the table available in the snippet as the variable <code>ORGTABLE</code>.
</p>

<p>
This is how clojure will represent the Org mode table. The <code>#+RESULTS:</code> part is the
output after execution of the snippet.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code</span>
<span style="color: #b3b3b3;">      </span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">clojure.pprint</span><span style="color: #b3b3b3;">/pprint ORGTABLE</span><span style="color: #DCDCCC;">)</span>
<span style="color: #7F9F7F;">#+END_SRC</span>

<span style="color: #7F9F7F;">#+RESULTS:</span>
<span style="color: #7F9F7F;">#+begin_src clojure</span>
<span style="color: #b3b3b3;">    </span><span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer1-stage"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">     </span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer1-prod"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">     </span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer2-stage"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">     </span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer2-prod"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">     </span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer3-stage"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">     </span><span style="color: #BFEBBF;">(</span><span style="color: #CC9393;">"customer3-prod"</span>
<span style="color: #b3b3b3;">      </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #7F9F7F;">#+end_src</span>
</pre>
</div>


<p>
The datastructure is a list with lists inside. I want to have it a little more
structured to be able to work with it. The snippet bellow makes it easier for me to
reason about it. The datastructure is a <a href="https://clojuredocs.org/clojure.core/hash-map">hash-map</a> with hash-maps for each customer. In
Clojure this will be very easy to work with.
</p>

<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code</span>
<span style="color: #b3b3b3;">      </span><span style="color: #DCDCCC;">(</span><span style="color: #7CB8BB;">clojure.pprint</span><span style="color: #b3b3b3;">/pprint</span>
<span style="color: #b3b3b3;">       </span><span style="color: #BFEBBF;">(</span><span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span><span style="color: #b3b3b3;"> ORGTABLE</span>
<span style="color: #b3b3b3;">            </span><span style="color: #D0BF8F;">(</span><span style="color: #b3b3b3;">reduce </span><span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">fn</span><span style="color: #b3b3b3;"> </span><span style="color: #9FC59F;">[</span><span style="color: #b3b3b3;">new-hashmap </span><span style="color: #94BFF3;">[</span><span style="color: #b3b3b3;">app-name db-host</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">]</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span><span style="color: #b3b3b3;"> </span><span style="color: #94BFF3;">[</span><span style="color: #E0CF9F;">[</span><span style="color: #b3b3b3;">_ customer env</span><span style="color: #E0CF9F;">]</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #b3b3b3;">re-matches #</span><span style="color: #CC9393;">"^</span><span style="color: #F0DFAF; font-weight: bold;">(</span><span style="color: #CC9393;">.+</span><span style="color: #F0DFAF; font-weight: bold;">)</span><span style="color: #CC9393;">-</span><span style="color: #F0DFAF; font-weight: bold;">(</span><span style="color: #CC9393;">.+</span><span style="color: #F0DFAF; font-weight: bold;">)</span><span style="color: #CC9393;">$"</span><span style="color: #b3b3b3;"> app-name</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span>
<span style="color: #b3b3b3;">                        </span><span style="color: #94BFF3;">(</span><span style="color: #b3b3b3;">update new-hashmap customer merge </span><span style="color: #E0CF9F;">{</span><span style="color: #8FB28F;">(</span><span style="color: #b3b3b3;">keyword </span><span style="color: #6CA0A3;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"app-name-"</span><span style="color: #b3b3b3;"> env</span><span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #b3b3b3;"> app-name</span>
<span style="color: #b3b3b3;">                                                            </span><span style="color: #8FB28F;">(</span><span style="color: #b3b3b3;">keyword </span><span style="color: #6CA0A3;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"db-host-"</span><span style="color: #b3b3b3;"> env</span><span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">)</span><span style="color: #b3b3b3;"> db-host</span><span style="color: #E0CF9F;">}</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span>
<span style="color: #b3b3b3;">                    </span><span style="color: #93E0E3;">{}</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
<span style="color: #7F9F7F;">#+END_SRC</span>

<span style="color: #7F9F7F;">#+RESULTS:</span>
<span style="color: #7F9F7F;">#+begin_src clojure</span>
<span style="color: #b3b3b3;">  </span><span style="color: #DCDCCC;">{</span><span style="color: #CC9393;">"customer1"</span>
<span style="color: #b3b3b3;">   </span><span style="color: #BFEBBF;">{</span><span style="color: #BFEBBF;">:app-name-stage</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"customer1-stage"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-stage</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"customer1-prod"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-prod</span><span style="color: #b3b3b3;">   </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">}</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">   </span><span style="color: #CC9393;">"customer2"</span>
<span style="color: #b3b3b3;">   </span><span style="color: #BFEBBF;">{</span><span style="color: #BFEBBF;">:app-name-stage</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"customer2-stage"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-stage</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"customer2-prod"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-prod</span><span style="color: #b3b3b3;">   </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">}</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">   </span><span style="color: #CC9393;">"customer3"</span>
<span style="color: #b3b3b3;">   </span><span style="color: #BFEBBF;">{</span><span style="color: #BFEBBF;">:app-name-stage</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"customer3-stage"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-stage</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;">  </span><span style="color: #CC9393;">"customer3-prod"</span><span style="color: #b3b3b3;">,</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">:db-host-prod</span><span style="color: #b3b3b3;">   </span><span style="color: #CC9393;">"jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com"</span><span style="color: #BFEBBF;">}</span><span style="color: #DCDCCC;">}</span>
<span style="color: #7F9F7F;">#+end_src</span>
</pre>
</div>
</div>
</div>
