generate-bash-script-with-orgmode.org
*** Generate a bash script

    Now when I have the Org mode table in a good datastructure it's time to generate the
    bash script. A [[https://clojuredocs.org/clojure.core/reduce][reduce]] can be helpful to go through the hash-map and genereate a
    string. The snippet bellow goes through the hash-map. For every customer it generates
    a =mongodump=, =mongorestore= command and then removes folder produced by =mongodump=.


    #+BEGIN_SRC org
      ,#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code
        (do
          (println
           (reduce (fn [new-string [customer h]]
                     (let [fill (clojure.string/join "" (repeat 25 "-"))
                           fills (str "echo \"" fill (clojure.string/upper-case customer) fill "\"\n")]
                       (str new-string
                            fills
                            "mongodump --gzip --host " (:db-host-prod h) " --db " (:app-name-prod h) " --ssl --out /tmp/db-dumps/ \n"
                            "mongorestore --drop --gzip --host " (:db-host-stage h) " --db " (:app-name-stage h) " --ssl /tmp/db-dumps/" (:app-name-prod h) "\n"
                            "rm -rf /tmp/" (:app-name-prod h) "\n"
                            fills
                            "\n"
                            ))
                     )
                   (str "#!/usr/bin/env bash\n\n"
                        "# This script will copy the production databases to the stage databases\n"
                        "# Generated: " (.format (java.text.SimpleDateFormat. "yyy-dd-MM HH:mm:ss") (java.util.Date.)) "\n\n\n")
                   (->> ORGTABLE
                        (reduce (fn [new-hashmap [app-name db-host]]
                                  (let [[_ customer env] (re-matches #"^(.+)-(.+)$" app-name)]
                                    (update new-hashmap customer merge {(keyword (str "app-name-" env)) app-name
                                                                        (keyword (str "db-host-" env)) db-host})))
                                {}))))
          'exit)
      ,#+END_SRC

      ,#+RESULTS:
      ,#+begin_src clojure
            #!/usr/bin/env bash

            # This script will copy the production databases to the stage databases
            # Generated: 2019-05-05 12:59:48


            echo "-------------------------CUSTOMER1-------------------------"
            mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer1-prod --ssl --out /tmp/db-dumps/
            mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer1-stage --ssl /tmp/db-dumps/customer1-prod
            rm -rf /tmp/customer1-prod
            echo "-------------------------CUSTOMER1-------------------------"

            echo "-------------------------CUSTOMER2-------------------------"
            mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer2-prod --ssl --out /tmp/db-dumps/
            mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer2-stage --ssl /tmp/db-dumps/customer2-prod
            rm -rf /tmp/customer2-prod
            echo "-------------------------CUSTOMER2-------------------------"

            echo "-------------------------CUSTOMER3-------------------------"
            mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer3-prod --ssl --out /tmp/db-dumps/
            mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer3-stage --ssl /tmp/db-dumps/customer3-prod
            rm -rf /tmp/customer3-prod
            echo "-------------------------CUSTOMER3-------------------------"


            exit
      ,#+end_src
    #+END_SRC


