generate-bash-script-with-orgmode.html


<div id="outline-container-orgd19fee4" class="outline-4">
<h4 id="orgd19fee4"><span class="section-number-4">2.3.3</span> Generate a bash script</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Now when I have the Org mode table in a good datastructure it&rsquo;s time to generate the
bash script. A <a href="https://clojuredocs.org/clojure.core/reduce">reduce</a> can be helpful to go through the hash-map and genereate a
string. The snippet bellow goes through the hash-map. For every customer it generates
a <code>mongodump</code>, <code>mongorestore</code> command and then removes folder produced by <code>mongodump</code>.
</p>


<div class="org-src-container">
<pre class="src src-org"><span style="color: #7F9F7F;">#+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code</span>
<span style="color: #b3b3b3;">  </span><span style="color: #DCDCCC;">(</span><span style="color: #F0DFAF; font-weight: bold;">do</span>
<span style="color: #b3b3b3;">    </span><span style="color: #BFEBBF;">(</span><span style="color: #b3b3b3;">println</span>
<span style="color: #b3b3b3;">     </span><span style="color: #D0BF8F;">(</span><span style="color: #b3b3b3;">reduce </span><span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">fn</span><span style="color: #b3b3b3;"> </span><span style="color: #9FC59F;">[</span><span style="color: #b3b3b3;">new-string </span><span style="color: #94BFF3;">[</span><span style="color: #b3b3b3;">customer h</span><span style="color: #94BFF3;">]</span><span style="color: #9FC59F;">]</span>
<span style="color: #b3b3b3;">               </span><span style="color: #9FC59F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span><span style="color: #b3b3b3;"> </span><span style="color: #94BFF3;">[</span><span style="color: #b3b3b3;">fill </span><span style="color: #E0CF9F;">(</span><span style="color: #7CB8BB;">clojure.string</span><span style="color: #b3b3b3;">/join </span><span style="color: #CC9393;">""</span><span style="color: #b3b3b3;"> </span><span style="color: #8FB28F;">(</span><span style="color: #b3b3b3;">repeat 25 </span><span style="color: #CC9393;">"-"</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span>
<span style="color: #b3b3b3;">                     fills </span><span style="color: #E0CF9F;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"echo </span><span style="color: #CC9393; font-weight: bold;">\"</span><span style="color: #CC9393;">"</span><span style="color: #b3b3b3;"> fill </span><span style="color: #8FB28F;">(</span><span style="color: #7CB8BB;">clojure.string</span><span style="color: #b3b3b3;">/upper-case customer</span><span style="color: #8FB28F;">)</span><span style="color: #b3b3b3;"> fill </span><span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\"\n</span><span style="color: #CC9393;">"</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">]</span>
<span style="color: #b3b3b3;">                 </span><span style="color: #94BFF3;">(</span><span style="color: #b3b3b3;">str new-string</span>
<span style="color: #b3b3b3;">                      fills</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #CC9393;">"mongodump --gzip --host "</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:db-host-prod</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">" --db "</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">" --ssl --out /tmp/db-dumps/ </span><span style="color: #CC9393; font-weight: bold;">\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #CC9393;">"mongorestore --drop --gzip --host "</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:db-host-stage</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">" --db "</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:app-name-stage</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">" --ssl /tmp/db-dumps/"</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #CC9393;">"rm -rf /tmp/"</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">(</span><span style="color: #BFEBBF;">:app-name-prod</span><span style="color: #b3b3b3;"> h</span><span style="color: #E0CF9F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                      fills</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                      </span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span>
<span style="color: #b3b3b3;">               </span><span style="color: #93E0E3;">)</span>
<span style="color: #b3b3b3;">             </span><span style="color: #93E0E3;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"#!/usr/bin/env bash</span><span style="color: #CC9393; font-weight: bold;">\n\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                  </span><span style="color: #CC9393;">"# This script will copy the production databases to the stage databases</span><span style="color: #CC9393; font-weight: bold;">\n</span><span style="color: #CC9393;">"</span>
<span style="color: #b3b3b3;">                  </span><span style="color: #CC9393;">"# Generated: "</span><span style="color: #b3b3b3;"> </span><span style="color: #9FC59F;">(</span><span style="color: #b3b3b3;">.format </span><span style="color: #94BFF3;">(</span><span style="color: #b3b3b3;">java.text.SimpleDateFormat. </span><span style="color: #CC9393;">"yyy-dd-MM HH:mm:ss"</span><span style="color: #94BFF3;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #94BFF3;">(</span><span style="color: #b3b3b3;">java.util.Date.</span><span style="color: #94BFF3;">)</span><span style="color: #9FC59F;">)</span><span style="color: #b3b3b3;"> </span><span style="color: #CC9393;">"</span><span style="color: #CC9393; font-weight: bold;">\n\n\n</span><span style="color: #CC9393;">"</span><span style="color: #93E0E3;">)</span>
<span style="color: #b3b3b3;">             </span><span style="color: #93E0E3;">(</span><span style="color: #F0DFAF; font-weight: bold;">-&gt;&gt;</span><span style="color: #b3b3b3;"> ORGTABLE</span>
<span style="color: #b3b3b3;">                  </span><span style="color: #9FC59F;">(</span><span style="color: #b3b3b3;">reduce </span><span style="color: #94BFF3;">(</span><span style="color: #F0DFAF; font-weight: bold;">fn</span><span style="color: #b3b3b3;"> </span><span style="color: #E0CF9F;">[</span><span style="color: #b3b3b3;">new-hashmap </span><span style="color: #8FB28F;">[</span><span style="color: #b3b3b3;">app-name db-host</span><span style="color: #8FB28F;">]</span><span style="color: #E0CF9F;">]</span>
<span style="color: #b3b3b3;">                            </span><span style="color: #E0CF9F;">(</span><span style="color: #F0DFAF; font-weight: bold;">let</span><span style="color: #b3b3b3;"> </span><span style="color: #8FB28F;">[</span><span style="color: #6CA0A3;">[</span><span style="color: #b3b3b3;">_ customer env</span><span style="color: #6CA0A3;">]</span><span style="color: #b3b3b3;"> </span><span style="color: #6CA0A3;">(</span><span style="color: #b3b3b3;">re-matches #</span><span style="color: #CC9393;">"^</span><span style="color: #F0DFAF; font-weight: bold;">(</span><span style="color: #CC9393;">.+</span><span style="color: #F0DFAF; font-weight: bold;">)</span><span style="color: #CC9393;">-</span><span style="color: #F0DFAF; font-weight: bold;">(</span><span style="color: #CC9393;">.+</span><span style="color: #F0DFAF; font-weight: bold;">)</span><span style="color: #CC9393;">$"</span><span style="color: #b3b3b3;"> app-name</span><span style="color: #6CA0A3;">)</span><span style="color: #8FB28F;">]</span>
<span style="color: #b3b3b3;">                              </span><span style="color: #8FB28F;">(</span><span style="color: #b3b3b3;">update new-hashmap customer merge </span><span style="color: #6CA0A3;">{</span><span style="color: #DCDCCC;">(</span><span style="color: #b3b3b3;">keyword </span><span style="color: #BFEBBF;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"app-name-"</span><span style="color: #b3b3b3;"> env</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span><span style="color: #b3b3b3;"> app-name</span>
<span style="color: #b3b3b3;">                                                                  </span><span style="color: #DCDCCC;">(</span><span style="color: #b3b3b3;">keyword </span><span style="color: #BFEBBF;">(</span><span style="color: #b3b3b3;">str </span><span style="color: #CC9393;">"db-host-"</span><span style="color: #b3b3b3;"> env</span><span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span><span style="color: #b3b3b3;"> db-host</span><span style="color: #6CA0A3;">}</span><span style="color: #8FB28F;">)</span><span style="color: #E0CF9F;">)</span><span style="color: #94BFF3;">)</span>
<span style="color: #b3b3b3;">                          </span><span style="color: #94BFF3;">{}</span><span style="color: #9FC59F;">)</span><span style="color: #93E0E3;">)</span><span style="color: #D0BF8F;">)</span><span style="color: #BFEBBF;">)</span>
<span style="color: #b3b3b3;">    'exit</span><span style="color: #DCDCCC;">)</span>
<span style="color: #7F9F7F;">#+END_SRC</span>

<span style="color: #7F9F7F;">#+RESULTS:</span>
<span style="color: #7F9F7F;">#+begin_src clojure</span>
<span style="color: #b3b3b3;">      </span><span style="color: #7CB8BB;">#!</span><span style="color: #b3b3b3;">/usr/bin/env bash</span>

<span style="color: #b3b3b3;">      # This script will copy the production databases to the stage databases</span>
<span style="color: #b3b3b3;">      # Generated: 2019-05-05 12:59:48</span>


<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER1-------------------------"</span>
<span style="color: #b3b3b3;">      mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer1-prod --ssl --out </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/</span>
<span style="color: #b3b3b3;">      mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer1-stage --ssl </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/customer1-prod</span>
<span style="color: #b3b3b3;">      rm -rf </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/customer1-prod</span>
<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER1-------------------------"</span>

<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER2-------------------------"</span>
<span style="color: #b3b3b3;">      mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer2-prod --ssl --out </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/</span>
<span style="color: #b3b3b3;">      mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer2-stage --ssl </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/customer2-prod</span>
<span style="color: #b3b3b3;">      rm -rf </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/customer2-prod</span>
<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER2-------------------------"</span>

<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER3-------------------------"</span>
<span style="color: #b3b3b3;">      mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer3-prod --ssl --out </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/</span>
<span style="color: #b3b3b3;">      mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer3-stage --ssl </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/db-dumps/customer3-prod</span>
<span style="color: #b3b3b3;">      rm -rf </span><span style="color: #7CB8BB;">/tmp</span><span style="color: #b3b3b3;">/customer3-prod</span>
<span style="color: #b3b3b3;">      echo </span><span style="color: #CC9393;">"-------------------------CUSTOMER3-------------------------"</span>


<span style="color: #b3b3b3;">      exit</span>
<span style="color: #7F9F7F;">#+end_src</span>
</pre>
</div>
</div>
</div>
</div>
</div>
