generate-bash-script-with-orgmode.org
* Discussion

  When we get new customers on board I can simply update the Org mode table and run
  =org-babel-execute-buffer= and it will produce a new script for me. I dont need to
  copy-paste and search-replace anymore!

  Org mode have some other features like [[https://orgmode.org/manual/Extracting-source-code.html][tangle]] and [[https://www.emacswiki.org/emacs/TrampMode][tramp]] that can be useful in
  combination with the stuff mentioned in this post.

  When I started using Org mode I found this post which was an eye opener
  http://www.howardism.org/Technical/Emacs/literate-devops.html


* Noexport                                                         :noexport:

  #+NAME: heroku-apps
  | Heroku app name | AWS MongoDB host                                     |
  |-----------------+------------------------------------------------------|
  | customer1-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
  | customer1-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
  | customer2-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
  | customer2-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
  | customer3-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
  | customer3-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
  | customer4-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
  | customer4-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |
  | customer5-stage | lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com |
  | customer5-prod  | jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com |



  #+BEGIN_SRC clojure :var ORGTABLE=heroku-apps :results output code
  (do
    (println
     (reduce (fn [new-string [customer h]]
               (let [fill (clojure.string/join "" (repeat 25 "-"))
                     fills (str "echo \"" fill (clojure.string/upper-case customer) fill "\"\n")]
                 (str new-string
                      fills
                      "mongodump --gzip --host " (:db-host-prod h) " --db " (:app-name-prod h) " --ssl --out /tmp/db-dumps/ \n"
                      "mongorestore --drop --gzip --host " (:db-host-stage h) " --db " (:app-name-stage h) " --ssl /tmp/db-dumps/" (:app-name-prod h) "\n"
                      "rm -rf /tmp/" (:app-name-prod h) "\n"
                      fills
                      "\n"
                      ))
               )
             (str "#!/usr/bin/env bash\n\n"
                  "# This script will copy the production databases to the stage databases\n"
                  "# Generated: " (.format (java.text.SimpleDateFormat. "yyy-dd-MM HH:mm:ss") (java.util.Date.)) "\n\n\n")
             (->> ORGTABLE
                  (reduce (fn [new-hashmap [app-name db-host]]
                            (let [[_ customer env] (re-matches #"^(.+)-(.+)$" app-name)]
                              (update new-hashmap customer merge {(keyword (str "app-name-" env)) app-name
                                                                  (keyword (str "db-host-" env)) db-host})))
                          {}))))
    'exit)
  #+END_SRC

  #+RESULTS:
  #+begin_src clojure
  #!/usr/bin/env bash

  # This script will copy the production databases to the stage databases
  # Generated: 2019-05-05 14:23:32


  echo "-------------------------CUSTOMER1-------------------------"
  mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer1-prod --ssl --out /tmp/db-dumps/
  mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer1-stage --ssl /tmp/db-dumps/customer1-prod
  rm -rf /tmp/customer1-prod
  echo "-------------------------CUSTOMER1-------------------------"

  echo "-------------------------CUSTOMER2-------------------------"
  mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer2-prod --ssl --out /tmp/db-dumps/
  mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer2-stage --ssl /tmp/db-dumps/customer2-prod
  rm -rf /tmp/customer2-prod
  echo "-------------------------CUSTOMER2-------------------------"

  echo "-------------------------CUSTOMER3-------------------------"
  mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer3-prod --ssl --out /tmp/db-dumps/
  mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer3-stage --ssl /tmp/db-dumps/customer3-prod
  rm -rf /tmp/customer3-prod
  echo "-------------------------CUSTOMER3-------------------------"

  echo "-------------------------CUSTOMER4-------------------------"
  mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer4-prod --ssl --out /tmp/db-dumps/
  mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer4-stage --ssl /tmp/db-dumps/customer4-prod
  rm -rf /tmp/customer4-prod
  echo "-------------------------CUSTOMER4-------------------------"

  echo "-------------------------CUSTOMER5-------------------------"
  mongodump --gzip --host jnlwdavhxhmmhtemxcwf.eu-west-1.compute.amazonaws.com --db customer5-prod --ssl --out /tmp/db-dumps/
  mongorestore --drop --gzip --host lyvyprpzxhpcmgmnccou.eu-west-1.compute.amazonaws.com --db customer5-stage --ssl /tmp/db-dumps/customer5-prod
  rm -rf /tmp/customer5-prod
  echo "-------------------------CUSTOMER5-------------------------"


  exit
  #+end_src
