generate-bash-script-with-orgmode.html


<div id="outline-container-orgbcc007d" class="outline-2">
<h2 id="orgbcc007d"><span class="section-number-2">3</span> Discussion</h2>
<div class="outline-text-2" id="text-3">
<p>
When we get new customers on board I can simply update the Org mode table and run
<code>org-babel-execute-buffer</code> and it will produce a new script for me. I dont need to
copy-paste and search-replace anymore!
</p>

<p>
Org mode have some other features like <a href="https://orgmode.org/manual/Extracting-source-code.html">tangle</a> and <a href="https://www.emacswiki.org/emacs/TrampMode">tramp</a> that can be useful in
combination with the stuff mentioned in this post.
</p>

<p>
When I started using Org mode I found this post which was an eye opener
<a href="http://www.howardism.org/Technical/Emacs/literate-devops.html">http://www.howardism.org/Technical/Emacs/literate-devops.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-05-05 Sun 00:00</p>
<p class="author">Author: John Herrlin</p>
<p class="date">Created: 2019-05-05 Sun 14:49</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
